//https:https://codeforces.com/problemset/problem/282/A
//Name: shajjad
//ID: 21225103142
/*
কিছু স্টেইট্মেন্ট , স্ট্রিং আকারে দেয়া থাকবে । সেখানে , স্টেইটমেন্ট এর আগে অথবা শেষ এর দিকে  - / +  চিহ্ন থাকতে পারে , প্রথমে ধরে নিতে হবে যে - বেইস মান ০ , তারপর -  স্টেইটমেন্ট অনুসারে , ১ করে বাড়বে অথবা , কমবে
যেমন ,
2
X++
--X
এর মানে , ধরেই নেই যে - এর মান প্রথমে ০ ছিলো , তারপর X++ এর কারণে , ১ বেড়ে মান হলো , ১
আবার ,  --X  এর কারনে , সেই মান কমে হলো ০ । সুতরাং , উত্তর হবে শূন্য (০) ।
*/
#include<bits/stdc++.h>
using namespace std;
int main()
{
    int n,sum=0;
    cin>>n;
    string s;
    for(int i=0;i<n;i++)
    {
    cin>>s;
    string s1="X++",s2="++X",s3="X--",s4="--X";
    if(s==s1 || s==s2)
    sum++;
    if(s==s3 || s==s4)
    sum--;
    }
    cout<<sum;

}
